#include "oars.h"
#include "oars_logn.h"
N(gor) { ο[ρ + 0 - σ * 0].c(ο, α, ρ + 1, σ); }
N(god) { ο[ρ + 0 - σ * 1].c(ο, α, ρ + 1, σ); }
N(got) { ο[ρ + 0 - σ * 2].c(ο, α, ρ + 1, σ); }
N(gor2) { ο[ρ + 1 - σ * 0].c(ο, α, ρ + 2, σ); }
N(god2) { ο[ρ + 1 - σ * 1].c(ο, α, ρ + 2, σ); }
N(got2) { ο[ρ + 1 - σ * 2].c(ο, α, ρ + 2, σ); }
N(gor3) { ο[ρ + 2 - σ * 0].c(ο, α, ρ + 3, σ); }
N(god3) { ο[ρ + 2 - σ * 1].c(ο, α, ρ + 3, σ); }
N(got3) { ο[ρ + 2 - σ * 2].c(ο, α, ρ + 3, σ); }
N(gor4) { ο[ρ + 3 - σ * 0].c(ο, α, ρ + 4, σ); }
N(god4) { ο[ρ + 3 - σ * 1].c(ο, α, ρ + 4, σ); }
N(got4) { ο[ρ + 3 - σ * 2].c(ο, α, ρ + 4, σ); }
N(gor5) { ο[ρ + 4 - σ * 0].c(ο, α, ρ + 5, σ); }
N(god5) { ο[ρ + 4 - σ * 1].c(ο, α, ρ + 5, σ); }
N(got5) { ο[ρ + 4 - σ * 2].c(ο, α, ρ + 5, σ); }
N(gor6) { ο[ρ + 5 - σ * 0].c(ο, α, ρ + 6, σ); }
N(god6) { ο[ρ + 5 - σ * 1].c(ο, α, ρ + 6, σ); }
N(got6) { ο[ρ + 5 - σ * 2].c(ο, α, ρ + 6, σ); }
N(gor7) { ο[ρ + 6 - σ * 0].c(ο, α, ρ + 7, σ); }
N(god7) { ο[ρ + 6 - σ * 1].c(ο, α, ρ + 7, σ); }
N(got7) { ο[ρ + 6 - σ * 2].c(ο, α, ρ + 7, σ); }
N(gor8) { ο[ρ + 7 - σ * 0].c(ο, α, ρ + 8, σ); }
N(god8) { ο[ρ + 7 - σ * 1].c(ο, α, ρ + 8, σ); }
N(got8) { ο[ρ + 7 - σ * 2].c(ο, α, ρ + 8, σ); }
N(ugor2) {
  ο[α++].v = ο[ρ++ - σ * 0].v;
  C(0);
}
N(ugod2) {
  ο[α++].v = ο[ρ++ - σ * 1].v;
  C(1);
}
N(ugot2) {
  ο[α++].v = ο[ρ++ - σ * 2].v;
  C(2);
}
N(ugor3) {
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  C(0);
}
N(ugod3) {
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  C(1);
}
N(ugot3) {
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  C(2);
}
N(ugor4) {
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  C(0);
}
N(ugod4) {
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  C(1);
}
N(ugot4) {
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  C(2);
}
N(ugor5) {
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  C(0);
}
N(ugod5) {
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  C(1);
}
N(ugot5) {
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  C(2);
}
N(ugor6) {
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  C(0);
}
N(ugod6) {
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  C(1);
}
N(ugot6) {
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  C(2);
}
N(ugor7) {
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  ο[α++].v = ο[ρ++ - σ * 0].v;
  C(0);
}
N(ugod7) {
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  ο[α++].v = ο[ρ++ - σ * 1].v;
  C(1);
}
N(ugot7) {
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  ο[α++].v = ο[ρ++ - σ * 2].v;
  C(2);
}
N(an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 1 - σ * 1].v = god;
  ο[ρ - 1 - σ * 2].v = got;
  ο[α - 1].c(ο, α - 1, ρ - 1, σ);
}
N(an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 3 - σ * 1].v = god3;

  ο[ρ - 3 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 4 - σ * 1].v = god4;

  ο[ρ - 4 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da) {
  ο[ρ - 1 - σ * 0].v = gor;
  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 1 - σ * 2].v = got;
  ο[α - 1].c(ο, α - 1, ρ - 1, σ);
}
N(daan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 1 - σ * 2].v = got;
  ο[α - 1].c(ο, α - 1, ρ - 1, σ);
}
N(daan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = god2;

  ο[ρ - 3 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(daan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = god3;

  ο[ρ - 4 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(daan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(daan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(daan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(daan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da2) {
  ο[ρ - 3 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 3 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(da2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 3 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(da2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 3 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(da2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 4 - σ * 1].v = god;

  ο[ρ - 4 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(da2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(da2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da3) {
  ο[ρ - 4 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 4 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(da3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 4 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(da3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 4 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 4 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(da3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 4 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(da3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(da3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da4) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(da4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(da4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(da4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(da4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 5 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(da4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da5) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 6 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(da5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da6) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 7 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(da6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(da7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 8 - σ * 2].v = got8;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara) {
  ο[ρ - 1 - σ * 0].v = gor;
  ο[ρ - 1 - σ * 1].v = god;
  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[α - 1].c(ο, α - 1, ρ - 1, σ);
}
N(araan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 1 - σ * 1].v = god;
  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[α - 1].c(ο, α - 1, ρ - 1, σ);
}
N(araan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 3 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(araan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 4 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(araan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(araan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(araan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(araan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada) {
  ο[ρ - 1 - σ * 0].v = gor;
  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[α - 1].c(ο, α - 1, ρ - 1, σ);
}
N(aradaan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[α - 1].c(ο, α - 1, ρ - 1, σ);
}
N(aradaan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(aradaan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(aradaan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(aradaan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(aradaan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(aradaan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada2) {
  ο[ρ - 3 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(arada2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(arada2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(arada2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 4 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(arada2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(arada2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada3) {
  ο[ρ - 4 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(arada3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(arada3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 4 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(arada3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(arada3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(arada3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada4) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(arada4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(arada4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(arada4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(arada4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(arada4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada5) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(arada5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada6) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = got6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(arada6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(arada7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = got7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2) {
  ο[ρ - 3 - σ * 0].v = gor3;

  ο[ρ - 3 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = gor2;

  ο[ρ - 3 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 3 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 4 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 4 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da) {
  ο[ρ - 3 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2daan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2daan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2daan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 4 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara2daan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2daan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2daan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2daan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da2) {
  ο[ρ - 3 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2da2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2da2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;

  ο[α - 1].c(ο, α - 1, ρ - 3, σ);
}
N(ara2da2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 4 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 4 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara2da2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2da2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da3) {
  ο[ρ - 4 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 4 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara2da3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 4 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara2da3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 4 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 4 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara2da3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 4 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara2da3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2da3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da4) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2da4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2da4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2da4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2da4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 5 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara2da4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da5) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 6 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara2da5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da6) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 7 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara2da6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara2da7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ugot2;
  ο[ρ - 8 - σ * 2].v = got5;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3) {
  ο[ρ - 4 - σ * 0].v = gor4;

  ο[ρ - 4 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = gor3;

  ο[ρ - 4 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 4 - σ * 0].v = gor;

  ο[ρ - 4 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 4 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da) {
  ο[ρ - 4 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3daan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3daan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 4 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3daan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3daan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3daan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3daan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3daan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da2) {
  ο[ρ - 4 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 4 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3da2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 4 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3da2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 4 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 4 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3da2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 4 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3da2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3da2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da3) {
  ο[ρ - 4 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3da3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3da3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 4 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3da3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;

  ο[α - 1].c(ο, α - 1, ρ - 4, σ);
}
N(ara3da3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3da3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da4) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3da4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3da4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3da4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3da4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 5 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara3da4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da5) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 6 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara3da5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da6) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 7 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara3da6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara3da7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ugot3;
  ο[ρ - 8 - σ * 2].v = got4;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 5 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4daan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4daan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4daan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4daan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4daan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4daan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4daan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da2) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 5 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da3) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 5 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da4) {
  ο[ρ - 5 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 5 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 5 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;

  ο[α - 1].c(ο, α - 1, ρ - 5, σ);
}
N(ara4da4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da5) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 6 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara4da5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da6) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 7 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara4da6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara4da7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ugot4;
  ο[ρ - 8 - σ * 2].v = got3;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 6 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5daan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5daan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5daan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5daan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5daan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5daan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5daan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da2) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 6 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da3) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 6 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da4) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 6 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da5) {
  ο[ρ - 6 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 6 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 6 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 6 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;

  ο[α - 1].c(ο, α - 1, ρ - 6, σ);
}
N(ara5da5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da6) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 7 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara5da6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara5da7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ugot5;
  ο[ρ - 8 - σ * 2].v = got2;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 7 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6daan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6daan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6daan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6daan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6daan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6daan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = god6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6daan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da2) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 7 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da3) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 7 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da4) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 7 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da5) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 7 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da6) {
  ο[ρ - 7 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = gor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 7 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 7 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 7 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 7 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;

  ο[α - 1].c(ο, α - 1, ρ - 7, σ);
}
N(ara6da6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara6da7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ugot6;
  ο[ρ - 8 - σ * 2].v = got;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 8 - σ * 1].v = god8;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7daan) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7daan2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7daan3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7daan4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7daan5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7daan6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7daan7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = god7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da2) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da2an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da2an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da2an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da2an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da2an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da2an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da2an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ugod2;
  ο[ρ - 8 - σ * 1].v = god5;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da3) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da3an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da3an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da3an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da3an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da3an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da3an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da3an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ugod3;
  ο[ρ - 8 - σ * 1].v = god4;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da4) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da4an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da4an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da4an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da4an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da4an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da4an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da4an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ugod4;
  ο[ρ - 8 - σ * 1].v = god3;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da5) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da5an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da5an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da5an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da5an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da5an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da5an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da5an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ugod5;
  ο[ρ - 8 - σ * 1].v = god2;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da6) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da6an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da6an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da6an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da6an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da6an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da6an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da6an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ugod6;
  ο[ρ - 8 - σ * 1].v = god;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da7) {
  ο[ρ - 8 - σ * 0].v = gor8;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da7an) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = gor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da7an2) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ugor2;
  ο[ρ - 8 - σ * 0].v = gor5;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da7an3) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ugor3;
  ο[ρ - 8 - σ * 0].v = gor4;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da7an4) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ugor4;
  ο[ρ - 8 - σ * 0].v = gor3;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da7an5) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ugor5;
  ο[ρ - 8 - σ * 0].v = gor2;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da7an6) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ugor6;
  ο[ρ - 8 - σ * 0].v = gor;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
N(ara7da7an7) {
  ο[ρ - 1 - σ * 0].v = ο[--α].v;
  ο[ρ - 2 - σ * 0].v = ο[--α].v;
  ο[ρ - 3 - σ * 0].v = ο[--α].v;
  ο[ρ - 4 - σ * 0].v = ο[--α].v;
  ο[ρ - 5 - σ * 0].v = ο[--α].v;
  ο[ρ - 6 - σ * 0].v = ο[--α].v;
  ο[ρ - 7 - σ * 0].v = ο[--α].v;
  ο[ρ - 8 - σ * 0].v = ugor7;

  ο[ρ - 1 - σ * 1].v = ο[--α].v;
  ο[ρ - 2 - σ * 1].v = ο[--α].v;
  ο[ρ - 3 - σ * 1].v = ο[--α].v;
  ο[ρ - 4 - σ * 1].v = ο[--α].v;
  ο[ρ - 5 - σ * 1].v = ο[--α].v;
  ο[ρ - 6 - σ * 1].v = ο[--α].v;
  ο[ρ - 7 - σ * 1].v = ο[--α].v;
  ο[ρ - 8 - σ * 1].v = ugod7;

  ο[ρ - 1 - σ * 2].v = ο[--α].v;
  ο[ρ - 2 - σ * 2].v = ο[--α].v;
  ο[ρ - 3 - σ * 2].v = ο[--α].v;
  ο[ρ - 4 - σ * 2].v = ο[--α].v;
  ο[ρ - 5 - σ * 2].v = ο[--α].v;
  ο[ρ - 6 - σ * 2].v = ο[--α].v;
  ο[ρ - 7 - σ * 2].v = ο[--α].v;
  ο[ρ - 8 - σ * 2].v = ugot7;

  ο[α - 1].c(ο, α - 1, ρ - 8, σ);
}
