#include "oant.h"
#include "oant_logn.h"
N(Gor) { ο[α + 0].c(ο, α + 3, ν, τ); }
N(God) { ο[α + 1].c(ο, α + 3, ν, τ); }
N(Got) { ο[α + 2].c(ο, α + 3, ν, τ); }
static
N(Gor2) { ο[α + 3].c(ο, α + 6, ν, τ); }
static
N(God2) { ο[α + 4].c(ο, α + 6, ν, τ); }
static
N(Got2) { ο[α + 5].c(ο, α + 6, ν, τ); }
static
N(Gor3) { ο[α + 6].c(ο, α + 9, ν, τ); }
static
N(God3) { ο[α + 7].c(ο, α + 9, ν, τ); }
static
N(Got3) { ο[α + 8].c(ο, α + 9, ν, τ); }
static
N(Gor4) { ο[α + 9].c(ο, α + 12, ν, τ); }
static
N(God4) { ο[α + 10].c(ο, α + 12, ν, τ); }
static
N(Got4) { ο[α + 11].c(ο, α + 12, ν, τ); }
static
N(Gor5) { ο[α + 12].c(ο, α + 15, ν, τ); }
static
N(God5) { ο[α + 13].c(ο, α + 15, ν, τ); }
static
N(Got5) { ο[α + 14].c(ο, α + 15, ν, τ); }
static
N(Gor6) { ο[α + 15].c(ο, α + 18, ν, τ); }
static
N(God6) { ο[α + 16].c(ο, α + 18, ν, τ); }
static
N(Got6) { ο[α + 17].c(ο, α + 18, ν, τ); }
static
N(Gor7) { ο[α + 18].c(ο, α + 21, ν, τ); }
static
N(God7) { ο[α + 19].c(ο, α + 21, ν, τ); }
static
N(Got7) { ο[α + 20].c(ο, α + 21, ν, τ); }
static
N(Gor8) { ο[α + 21].c(ο, α + 24, ν, τ); }
static
N(God8) { ο[α + 22].c(ο, α + 24, ν, τ); }
static
N(Got8) { ο[α + 23].c(ο, α + 24, ν, τ); }
static
N(unGor2) {
  ν[τ++].v = ο[α + 0].v; α += 3;
  C(0);
}
static
N(unGod2) {
  ν[τ++].v = ο[α + 1].v; α += 3;
  C(1);
}
static
N(unGot2) {
  ν[τ++].v = ο[α + 2].v; α += 3;
  C(2);
}
static
N(unGor3) {
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  C(0);
}
static
N(unGod3) {
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  C(1);
}
static
N(unGot3) {
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  C(2);
}
static
N(unGor4) {
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  C(0);
}
static
N(unGod4) {
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  C(1);
}
static
N(unGot4) {
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  C(2);
}
static
N(unGor5) {
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  C(0);
}
static
N(unGod5) {
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  C(1);
}
static
N(unGot5) {
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  C(2);
}
static
N(unGor6) {
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  C(0);
}
static
N(unGod6) {
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  C(1);
}
static
N(unGot6) {
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  C(2);
}
static
N(unGor7) {
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  ν[τ++].v = ο[α + 0].v; α += 3;
  C(0);
}
static
N(unGod7) {
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  ν[τ++].v = ο[α + 1].v; α += 3;
  C(1);
}
static
N(unGot7) {
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  ν[τ++].v = ο[α + 2].v; α += 3;
  C(2);
}
N(ψ1) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 2].v = God;
  ο[α - 1].v = Got;
  ν[τ - 1].c(ο, α - 3, ν, τ - 1);
}
N(ψ2) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 8].v = God3;

  ο[α - 7].v = Got3;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ3) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 11].v = God4;

  ο[α - 10].v = Got4;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ4) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 14].v = God5;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ5) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 17].v = God6;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ6) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 20].v = God7;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ7) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 23].v = God8;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ10) {
  ο[α - 3].v = Gor;
  ο[α - 2].v = ν[--τ].v;
  ο[α - 1].v = Got;
  ν[τ - 1].c(ο, α - 3, ν, τ - 1);
}
N(ψ11) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 2].v = ν[--τ].v;
  ο[α - 1].v = Got;
  ν[τ - 1].c(ο, α - 3, ν, τ - 1);
}
N(ψ12) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 8].v = God2;

  ο[α - 7].v = Got3;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ13) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 11].v = God3;

  ο[α - 10].v = Got4;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ14) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ15) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ16) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ17) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ20) {
  ο[α - 9].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 7].v = Got3;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ21) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 9].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 7].v = Got3;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ22) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 7].v = Got3;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ23) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 11].v = God;

  ο[α - 10].v = Got4;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ24) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ25) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ26) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ27) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ30) {
  ο[α - 12].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 10].v = Got4;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ31) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 12].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 10].v = Got4;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ32) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 12].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 10].v = Got4;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ33) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 10].v = Got4;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ34) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ35) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ36) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ37) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ40) {
  ο[α - 15].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ41) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ42) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ43) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ44) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 13].v = Got5;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ45) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ46) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ47) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ50) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ51) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ52) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ53) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ54) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ55) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 16].v = Got6;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ56) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ57) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ60) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ61) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ62) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ63) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ64) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ65) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ66) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 19].v = Got7;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ67) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ70) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ71) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ72) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ73) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ74) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ75) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ76) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ77) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 22].v = Got8;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ100) {
  ο[α - 3].v = Gor;
  ο[α - 2].v = God;
  ο[α - 1].v = ν[--τ].v;
  ν[τ - 1].c(ο, α - 3, ν, τ - 1);
}
N(ψ101) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 2].v = God;
  ο[α - 1].v = ν[--τ].v;
  ν[τ - 1].c(ο, α - 3, ν, τ - 1);
}
N(ψ102) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 8].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 7].v = Got2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ103) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 11].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 10].v = Got3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ104) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 14].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ105) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ106) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ107) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ110) {
  ο[α - 3].v = Gor;
  ο[α - 2].v = ν[--τ].v;
  ο[α - 1].v = ν[--τ].v;
  ν[τ - 1].c(ο, α - 3, ν, τ - 1);
}
N(ψ111) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 2].v = ν[--τ].v;
  ο[α - 1].v = ν[--τ].v;
  ν[τ - 1].c(ο, α - 3, ν, τ - 1);
}
N(ψ112) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 8].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 7].v = Got2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ113) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 11].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 10].v = Got3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ114) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ115) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ116) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ117) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ120) {
  ο[α - 9].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 7].v = Got2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ121) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 9].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 7].v = Got2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ122) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 7].v = Got2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ123) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 11].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 10].v = Got3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ124) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ125) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ126) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ127) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ130) {
  ο[α - 12].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 10].v = Got3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ131) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 12].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 10].v = Got3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ132) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 12].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 10].v = Got3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ133) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 10].v = Got3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ134) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ135) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ136) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ137) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ140) {
  ο[α - 15].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ141) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ142) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ143) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ144) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 13].v = Got4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ145) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ146) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ147) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ150) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ151) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ152) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ153) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ154) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ155) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 16].v = Got5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ156) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ157) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ160) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ161) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ162) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ163) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ164) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ165) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ166) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 19].v = Got6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ167) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ170) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ171) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ172) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ173) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ174) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ175) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ176) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ177) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 22].v = Got7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ200) {
  ο[α - 9].v = Gor3;

  ο[α - 8].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ201) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 9].v = Gor2;

  ο[α - 8].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ202) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 8].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ203) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 11].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 10].v = Got;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ204) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 14].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ205) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ206) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ207) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ210) {
  ο[α - 9].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 8].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ211) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 9].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 8].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ212) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 8].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ213) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 11].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 10].v = Got;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ214) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ215) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ216) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ217) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ220) {
  ο[α - 9].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ221) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 9].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ222) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;

  ν[τ - 1].c(ο, α - 9, ν, τ - 1);
}
N(ψ223) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 11].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 10].v = Got;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ224) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ225) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ226) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ227) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ230) {
  ο[α - 12].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 10].v = Got;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ231) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 12].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 10].v = Got;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ232) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 12].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 10].v = Got;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ233) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 10].v = Got;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ234) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ235) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ236) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ237) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ240) {
  ο[α - 15].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ241) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ242) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ243) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ244) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 13].v = Got2;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ245) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ246) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ247) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ250) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ251) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ252) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ253) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ254) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ255) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 16].v = Got3;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ256) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ257) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ260) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ261) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ262) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ263) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ264) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ265) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ266) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 19].v = Got4;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ267) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ270) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ271) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ272) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ273) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ274) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ275) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ276) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ277) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = unGot2;
  ο[α - 22].v = Got5;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ300) {
  ο[α - 12].v = Gor4;

  ο[α - 11].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ301) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 12].v = Gor3;

  ο[α - 11].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ302) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 12].v = Gor;

  ο[α - 11].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ303) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 11].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ304) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 14].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ305) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ306) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ307) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ310) {
  ο[α - 12].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 11].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ311) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 12].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 11].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ312) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 12].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 11].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ313) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 11].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ314) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ315) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ316) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ317) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ320) {
  ο[α - 12].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 11].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ321) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 12].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 11].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ322) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 12].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 11].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ323) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 11].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ324) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ325) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ326) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ327) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ330) {
  ο[α - 12].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ331) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 12].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ332) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 12].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ333) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;

  ν[τ - 1].c(ο, α - 12, ν, τ - 1);
}
N(ψ334) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ335) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ336) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ337) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ340) {
  ο[α - 15].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ341) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ342) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ343) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ344) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 13].v = Got;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ345) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ346) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ347) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ350) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ351) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ352) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ353) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ354) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ355) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 16].v = Got2;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ356) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ357) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ360) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ361) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ362) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ363) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ364) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ365) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ366) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 19].v = Got3;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ367) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ370) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ371) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ372) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ373) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ374) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ375) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ376) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ377) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = unGot3;
  ο[α - 22].v = Got4;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ400) {
  ο[α - 15].v = Gor5;

  ο[α - 14].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ401) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 14].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ402) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 14].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ403) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 14].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ404) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 14].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ405) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ406) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ407) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ410) {
  ο[α - 15].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ411) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ412) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ413) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ414) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 14].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ415) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ416) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ417) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ420) {
  ο[α - 15].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ421) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ422) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ423) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ424) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 14].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ425) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ426) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ427) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ430) {
  ο[α - 15].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ431) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ432) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ433) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ434) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 14].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ435) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ436) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ437) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ440) {
  ο[α - 15].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ441) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 15].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ442) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 15].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ443) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 15].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ444) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;

  ν[τ - 1].c(ο, α - 15, ν, τ - 1);
}
N(ψ445) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ446) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ447) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ450) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ451) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ452) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ453) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ454) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ455) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 16].v = Got;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ456) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ457) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ460) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ461) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ462) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ463) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ464) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ465) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ466) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 19].v = Got2;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ467) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ470) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ471) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ472) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ473) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ474) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ475) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ476) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ477) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = unGot4;
  ο[α - 22].v = Got3;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ500) {
  ο[α - 18].v = Gor6;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ501) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ502) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ503) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ504) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ505) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 17].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ506) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ507) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ510) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ511) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ512) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ513) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ514) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ515) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 17].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ516) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ517) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ520) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ521) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ522) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ523) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ524) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ525) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 17].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ526) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ527) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ530) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ531) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ532) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ533) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ534) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ535) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 17].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ536) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ537) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ540) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ541) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ542) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ543) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ544) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ545) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 17].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ546) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ547) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ550) {
  ο[α - 18].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ551) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 18].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ552) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 18].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ553) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 18].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ554) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 18].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ555) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;

  ν[τ - 1].c(ο, α - 18, ν, τ - 1);
}
N(ψ556) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ557) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ560) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ561) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ562) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ563) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ564) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ565) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ566) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 19].v = Got;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ567) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ570) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ571) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ572) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ573) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ574) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ575) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ576) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ577) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = unGot5;
  ο[α - 22].v = Got2;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ600) {
  ο[α - 21].v = Gor7;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ601) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ602) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ603) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ604) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ605) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ606) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 20].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ607) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ610) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ611) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ612) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ613) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ614) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ615) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ616) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 20].v = God6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ617) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ620) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ621) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ622) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ623) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ624) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ625) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ626) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 20].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ627) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ630) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ631) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ632) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ633) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ634) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ635) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ636) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 20].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ637) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ640) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ641) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ642) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ643) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ644) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ645) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ646) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 20].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ647) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ650) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ651) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ652) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ653) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ654) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ655) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ656) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 20].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ657) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ660) {
  ο[α - 21].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ661) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 21].v = Gor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ662) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 21].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ663) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 21].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ664) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 21].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ665) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 21].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ666) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;

  ν[τ - 1].c(ο, α - 21, ν, τ - 1);
}
N(ψ667) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ670) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ671) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ672) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ673) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ674) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ675) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ676) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ677) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = unGot6;
  ο[α - 22].v = Got;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ700) {
  ο[α - 24].v = Gor8;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ701) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ702) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ703) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ704) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ705) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ706) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ707) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 23].v = God8;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ710) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ711) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ712) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ713) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ714) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ715) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ716) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ717) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 23].v = God7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ720) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ721) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ722) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ723) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ724) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ725) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ726) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ727) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = unGod2;
  ο[α - 23].v = God5;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ730) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ731) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ732) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ733) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ734) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ735) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ736) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ737) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = unGod3;
  ο[α - 23].v = God4;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ740) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ741) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ742) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ743) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ744) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ745) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ746) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ747) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = unGod4;
  ο[α - 23].v = God3;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ750) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ751) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ752) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ753) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ754) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ755) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ756) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ757) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = unGod5;
  ο[α - 23].v = God2;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ760) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ761) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ762) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ763) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ764) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ765) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ766) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ767) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = unGod6;
  ο[α - 23].v = God;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ770) {
  ο[α - 24].v = Gor8;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ771) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 24].v = Gor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ772) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = unGor2;
  ο[α - 24].v = Gor5;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ773) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = unGor3;
  ο[α - 24].v = Gor4;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ774) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = unGor4;
  ο[α - 24].v = Gor3;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ775) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = unGor5;
  ο[α - 24].v = Gor2;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ776) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = unGor6;
  ο[α - 24].v = Gor;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ777) {
  ο[α - 3].v = ν[--τ].v;
  ο[α - 6].v = ν[--τ].v;
  ο[α - 9].v = ν[--τ].v;
  ο[α - 12].v = ν[--τ].v;
  ο[α - 15].v = ν[--τ].v;
  ο[α - 18].v = ν[--τ].v;
  ο[α - 21].v = ν[--τ].v;
  ο[α - 24].v = unGor7;

  ο[α - 2].v = ν[--τ].v;
  ο[α - 5].v = ν[--τ].v;
  ο[α - 8].v = ν[--τ].v;
  ο[α - 11].v = ν[--τ].v;
  ο[α - 14].v = ν[--τ].v;
  ο[α - 17].v = ν[--τ].v;
  ο[α - 20].v = ν[--τ].v;
  ο[α - 23].v = unGod7;

  ο[α - 1].v = ν[--τ].v;
  ο[α - 4].v = ν[--τ].v;
  ο[α - 7].v = ν[--τ].v;
  ο[α - 10].v = ν[--τ].v;
  ο[α - 13].v = ν[--τ].v;
  ο[α - 16].v = ν[--τ].v;
  ο[α - 19].v = ν[--τ].v;
  ο[α - 22].v = unGot7;

  ν[τ - 1].c(ο, α - 24, ν, τ - 1);
}
N(ψ0) { ν[τ - 1].c(ο, α, ν, τ - 1); }
n_t ψ[01000] = {
  ψ0,
  ψ1,
  ψ2,
  ψ3,
  ψ4,
  ψ5,
  ψ6,
  ψ7,
  ψ10,
  ψ11,
  ψ12,
  ψ13,
  ψ14,
  ψ15,
  ψ16,
  ψ17,
  ψ20,
  ψ21,
  ψ22,
  ψ23,
  ψ24,
  ψ25,
  ψ26,
  ψ27,
  ψ30,
  ψ31,
  ψ32,
  ψ33,
  ψ34,
  ψ35,
  ψ36,
  ψ37,
  ψ40,
  ψ41,
  ψ42,
  ψ43,
  ψ44,
  ψ45,
  ψ46,
  ψ47,
  ψ50,
  ψ51,
  ψ52,
  ψ53,
  ψ54,
  ψ55,
  ψ56,
  ψ57,
  ψ60,
  ψ61,
  ψ62,
  ψ63,
  ψ64,
  ψ65,
  ψ66,
  ψ67,
  ψ70,
  ψ71,
  ψ72,
  ψ73,
  ψ74,
  ψ75,
  ψ76,
  ψ77,
  ψ100,
  ψ101,
  ψ102,
  ψ103,
  ψ104,
  ψ105,
  ψ106,
  ψ107,
  ψ110,
  ψ111,
  ψ112,
  ψ113,
  ψ114,
  ψ115,
  ψ116,
  ψ117,
  ψ120,
  ψ121,
  ψ122,
  ψ123,
  ψ124,
  ψ125,
  ψ126,
  ψ127,
  ψ130,
  ψ131,
  ψ132,
  ψ133,
  ψ134,
  ψ135,
  ψ136,
  ψ137,
  ψ140,
  ψ141,
  ψ142,
  ψ143,
  ψ144,
  ψ145,
  ψ146,
  ψ147,
  ψ150,
  ψ151,
  ψ152,
  ψ153,
  ψ154,
  ψ155,
  ψ156,
  ψ157,
  ψ160,
  ψ161,
  ψ162,
  ψ163,
  ψ164,
  ψ165,
  ψ166,
  ψ167,
  ψ170,
  ψ171,
  ψ172,
  ψ173,
  ψ174,
  ψ175,
  ψ176,
  ψ177,
  ψ200,
  ψ201,
  ψ202,
  ψ203,
  ψ204,
  ψ205,
  ψ206,
  ψ207,
  ψ210,
  ψ211,
  ψ212,
  ψ213,
  ψ214,
  ψ215,
  ψ216,
  ψ217,
  ψ220,
  ψ221,
  ψ222,
  ψ223,
  ψ224,
  ψ225,
  ψ226,
  ψ227,
  ψ230,
  ψ231,
  ψ232,
  ψ233,
  ψ234,
  ψ235,
  ψ236,
  ψ237,
  ψ240,
  ψ241,
  ψ242,
  ψ243,
  ψ244,
  ψ245,
  ψ246,
  ψ247,
  ψ250,
  ψ251,
  ψ252,
  ψ253,
  ψ254,
  ψ255,
  ψ256,
  ψ257,
  ψ260,
  ψ261,
  ψ262,
  ψ263,
  ψ264,
  ψ265,
  ψ266,
  ψ267,
  ψ270,
  ψ271,
  ψ272,
  ψ273,
  ψ274,
  ψ275,
  ψ276,
  ψ277,
  ψ300,
  ψ301,
  ψ302,
  ψ303,
  ψ304,
  ψ305,
  ψ306,
  ψ307,
  ψ310,
  ψ311,
  ψ312,
  ψ313,
  ψ314,
  ψ315,
  ψ316,
  ψ317,
  ψ320,
  ψ321,
  ψ322,
  ψ323,
  ψ324,
  ψ325,
  ψ326,
  ψ327,
  ψ330,
  ψ331,
  ψ332,
  ψ333,
  ψ334,
  ψ335,
  ψ336,
  ψ337,
  ψ340,
  ψ341,
  ψ342,
  ψ343,
  ψ344,
  ψ345,
  ψ346,
  ψ347,
  ψ350,
  ψ351,
  ψ352,
  ψ353,
  ψ354,
  ψ355,
  ψ356,
  ψ357,
  ψ360,
  ψ361,
  ψ362,
  ψ363,
  ψ364,
  ψ365,
  ψ366,
  ψ367,
  ψ370,
  ψ371,
  ψ372,
  ψ373,
  ψ374,
  ψ375,
  ψ376,
  ψ377,
  ψ400,
  ψ401,
  ψ402,
  ψ403,
  ψ404,
  ψ405,
  ψ406,
  ψ407,
  ψ410,
  ψ411,
  ψ412,
  ψ413,
  ψ414,
  ψ415,
  ψ416,
  ψ417,
  ψ420,
  ψ421,
  ψ422,
  ψ423,
  ψ424,
  ψ425,
  ψ426,
  ψ427,
  ψ430,
  ψ431,
  ψ432,
  ψ433,
  ψ434,
  ψ435,
  ψ436,
  ψ437,
  ψ440,
  ψ441,
  ψ442,
  ψ443,
  ψ444,
  ψ445,
  ψ446,
  ψ447,
  ψ450,
  ψ451,
  ψ452,
  ψ453,
  ψ454,
  ψ455,
  ψ456,
  ψ457,
  ψ460,
  ψ461,
  ψ462,
  ψ463,
  ψ464,
  ψ465,
  ψ466,
  ψ467,
  ψ470,
  ψ471,
  ψ472,
  ψ473,
  ψ474,
  ψ475,
  ψ476,
  ψ477,
  ψ500,
  ψ501,
  ψ502,
  ψ503,
  ψ504,
  ψ505,
  ψ506,
  ψ507,
  ψ510,
  ψ511,
  ψ512,
  ψ513,
  ψ514,
  ψ515,
  ψ516,
  ψ517,
  ψ520,
  ψ521,
  ψ522,
  ψ523,
  ψ524,
  ψ525,
  ψ526,
  ψ527,
  ψ530,
  ψ531,
  ψ532,
  ψ533,
  ψ534,
  ψ535,
  ψ536,
  ψ537,
  ψ540,
  ψ541,
  ψ542,
  ψ543,
  ψ544,
  ψ545,
  ψ546,
  ψ547,
  ψ550,
  ψ551,
  ψ552,
  ψ553,
  ψ554,
  ψ555,
  ψ556,
  ψ557,
  ψ560,
  ψ561,
  ψ562,
  ψ563,
  ψ564,
  ψ565,
  ψ566,
  ψ567,
  ψ570,
  ψ571,
  ψ572,
  ψ573,
  ψ574,
  ψ575,
  ψ576,
  ψ577,
  ψ600,
  ψ601,
  ψ602,
  ψ603,
  ψ604,
  ψ605,
  ψ606,
  ψ607,
  ψ610,
  ψ611,
  ψ612,
  ψ613,
  ψ614,
  ψ615,
  ψ616,
  ψ617,
  ψ620,
  ψ621,
  ψ622,
  ψ623,
  ψ624,
  ψ625,
  ψ626,
  ψ627,
  ψ630,
  ψ631,
  ψ632,
  ψ633,
  ψ634,
  ψ635,
  ψ636,
  ψ637,
  ψ640,
  ψ641,
  ψ642,
  ψ643,
  ψ644,
  ψ645,
  ψ646,
  ψ647,
  ψ650,
  ψ651,
  ψ652,
  ψ653,
  ψ654,
  ψ655,
  ψ656,
  ψ657,
  ψ660,
  ψ661,
  ψ662,
  ψ663,
  ψ664,
  ψ665,
  ψ666,
  ψ667,
  ψ670,
  ψ671,
  ψ672,
  ψ673,
  ψ674,
  ψ675,
  ψ676,
  ψ677,
  ψ700,
  ψ701,
  ψ702,
  ψ703,
  ψ704,
  ψ705,
  ψ706,
  ψ707,
  ψ710,
  ψ711,
  ψ712,
  ψ713,
  ψ714,
  ψ715,
  ψ716,
  ψ717,
  ψ720,
  ψ721,
  ψ722,
  ψ723,
  ψ724,
  ψ725,
  ψ726,
  ψ727,
  ψ730,
  ψ731,
  ψ732,
  ψ733,
  ψ734,
  ψ735,
  ψ736,
  ψ737,
  ψ740,
  ψ741,
  ψ742,
  ψ743,
  ψ744,
  ψ745,
  ψ746,
  ψ747,
  ψ750,
  ψ751,
  ψ752,
  ψ753,
  ψ754,
  ψ755,
  ψ756,
  ψ757,
  ψ760,
  ψ761,
  ψ762,
  ψ763,
  ψ764,
  ψ765,
  ψ766,
  ψ767,
  ψ770,
  ψ771,
  ψ772,
  ψ773,
  ψ774,
  ψ775,
  ψ776,
  ψ777,
};
