#pragma once
#define ΑND                                                                    \
  S(Δ4_C0)        { ρ += 4, C(0); };                                           \
  S(Δ3_SO1_O)     { ρ += 3, Α(ο[ρ++].v) O; };                                  \
  S(Δ4_C2)        { ρ += 4, C(2); };                                           \
  S(αnd) {                                                                     \
    ο[--ρ].c = σ[--α].c;                                                       \
    ο[--ρ].v = Δ4_C2, ο[--ρ].v = Δ3_SO1_O, ο[--ρ].v = Δ4_C0, O;                \
  }

#define ΑNDOR3                                                                 \
  S(Δ7_C2)        { ρ += 7, C(2); };                                           \
  S(Δ3_SO1_D3_O)  { ρ += 3, Α(ο[ρ++].v) ρ += 3, O; };                          \
  S(Δ4_SO3_O)     { ρ += 4, Α(ο[ρ++].v, ο[ρ++].v, ο[ρ++].v) O; };              \
  S(αndor3) {                                                                  \
    ο[--ρ].c = σ[--α].c;                                                       \
    ο[--ρ].c = σ[--α].c;                                                       \
    ο[--ρ].c = σ[--α].c;                                                       \
    ο[--ρ].c = σ[--α].c;                                                       \
    ο[--ρ].v = Δ7_C2, ο[--ρ].v = Δ3_SO1_D3_O, ο[--ρ].v = Δ4_SO3_O, O;          \
  }
