#include "aradani.h"
#include <stdio.h>
N(აფურცელი) { A(0) σ[-1].c(T()); }
N(აგულგული) { A(1) σ[-1].c(T()); }
N(ამოწერე) { A(2) σ[-1].c(T()); }
N(წერტილი) { A(3) σ[-1].c(T()); }
N(შემდეგი) { A(4) σ[-1].c(T()); }

N(ან_გადასვლა) { C(, 0); }
N(და_გადასვლა) { C(, 1); }
N(sss) {
  R(n_t, nar);
  R(unsigned long, c);
  R(p_t *, sσ);
  A12(σ, c + 1, nar, აფურცელი, 4, ამოწერე, დაა, sσ, წერტილი, დაა, შემდეგი, და)
  O;
}
N(წყაროს_ან) { A2(ან_გადასვლა, sss) O; }
N(წყაროს_და) {
  if (ο[α - 1].Q % 1000000 == 0)
    printf("%s, c: %ld\n", (char *)ο[α - 3].v, ο[α - 1].q);
  A2(და_გადასვლა, sss) O;
}
N(წყაროს_არა) {}
N(კალაპოტის_ან) { A2(და_გადასვლა, sss) O; }
N(კალაპოტის_და) {
  if (ο[α - 1].Q % 1000000 == 0)
    printf("c: %ld\n", ο[α - 1].q);
  A2(და_გადასვლა, sss) O;
}
N(კალაპოტის_არა) {}
N(აწყაროსგულგული) {
  A10(წყაროს_ან, წყაროს_და, წყაროს_არა, 3, 6, 9, σ[-1].c, 7, 1, აგულგული) O;
}
N(აკალაპოტი) {
  A10(კალაპოტის_ან, კალაპოტის_და, კალაპოტის_არა, 3, 9, 6, σ[-1].c, 7, 1,
      აგულგული)
  O;
}
N(წყარო_კალაპოტის_ციკლის_მაგალითი) {
  A12(აკალაპოტი, -2, ან_გადასვლა, აფურცელი, დააა, 4, ამოწერე, დაა,
      აწყაროსგულგული, და, წერტილი, და)
  O;
}
N(მთავარი) {
  n_t exam = წყარო_კალაპოტის_ციკლის_მაგალითი;
  A8("პირველი", exam, "მეორე", exam, დაა, "მესამე", exam, დაა) O;
  // A5("პირველი", exam, "მეორე", exam, დაა) O;
  // A2("პირველი", exam) O;
}
N(main1) { მთავარი(T()); }
