#include "oant.h"
#include "oant_logn.h"
#define QPS 64

p_t*queue[QPS];
p_t queue_papers[QPS][32];
Q_t queue_papers_end = 0, queue_papers_begin = 0;
static N(ο0) { queue_papers[queue_papers_begin][0].c(T); }

static N(unο1) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  τ += 1;
  O;
}
static N(ο1) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο1;
  τ -= 1;
  p[1].v = ν[τ + 0].v;
  O;
}

static N(unο2) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  τ += 2;
  O;
}
static N(ο2) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο2;
  τ -= 2;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  O;
}

static N(unο3) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  τ += 3;
  O;
}
static N(ο3) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο3;
  τ -= 3;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  O;
}

static N(unο4) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  τ += 4;
  O;
}
static N(ο4) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο4;
  τ -= 4;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  O;
}

static N(unο5) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  τ += 5;
  O;
}
static N(ο5) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο5;
  τ -= 5;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  O;
}

static N(unο6) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  τ += 6;
  O;
}
static N(ο6) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο6;
  τ -= 6;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  O;
}

static N(unο7) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  τ += 7;
  O;
}
static N(ο7) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο7;
  τ -= 7;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  O;
}

static N(unο8) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  τ += 8;
  O;
}
static N(ο8) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο8;
  τ -= 8;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  O;
}

static N(unο9) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  τ += 9;
  O;
}
static N(ο9) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο9;
  τ -= 9;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  O;
}

static N(unο10) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  τ += 10;
  O;
}
static N(ο10) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο10;
  τ -= 10;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  O;
}

static N(unο11) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  τ += 11;
  O;
}
static N(ο11) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο11;
  τ -= 11;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  O;
}

static N(unο12) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  τ += 12;
  O;
}
static N(ο12) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο12;
  τ -= 12;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  O;
}

static N(unο13) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  τ += 13;
  O;
}
static N(ο13) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο13;
  τ -= 13;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  O;
}

static N(unο14) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  τ += 14;
  O;
}
static N(ο14) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο14;
  τ -= 14;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  O;
}

static N(unο15) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  τ += 15;
  O;
}
static N(ο15) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο15;
  τ -= 15;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  O;
}

static N(unο16) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  τ += 16;
  O;
}
static N(ο16) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο16;
  τ -= 16;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  O;
}

static N(unο17) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  τ += 17;
  O;
}
static N(ο17) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο17;
  τ -= 17;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  O;
}

static N(unο18) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  τ += 18;
  O;
}
static N(ο18) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο18;
  τ -= 18;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  O;
}

static N(unο19) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  τ += 19;
  O;
}
static N(ο19) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο19;
  τ -= 19;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  O;
}

static N(unο20) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  τ += 20;
  O;
}
static N(ο20) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο20;
  τ -= 20;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  O;
}

static N(unο21) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  τ += 21;
  O;
}
static N(ο21) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο21;
  τ -= 21;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  O;
}

static N(unο22) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  τ += 22;
  O;
}
static N(ο22) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο22;
  τ -= 22;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  O;
}

static N(unο23) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  τ += 23;
  O;
}
static N(ο23) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο23;
  τ -= 23;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  O;
}

static N(unο24) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  τ += 24;
  O;
}
static N(ο24) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο24;
  τ -= 24;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  O;
}

static N(unο25) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  τ += 25;
  O;
}
static N(ο25) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο25;
  τ -= 25;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  O;
}

static N(unο26) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  τ += 26;
  O;
}
static N(ο26) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο26;
  τ -= 26;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  O;
}

static N(unο27) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  τ += 27;
  O;
}
static N(ο27) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο27;
  τ -= 27;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  O;
}

static N(unο28) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  ν[τ + 27].v = p[28].v;
  τ += 28;
  O;
}
static N(ο28) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο28;
  τ -= 28;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  p[28].v = ν[τ + 27].v;
  O;
}

static N(unο29) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  ν[τ + 27].v = p[28].v;
  ν[τ + 28].v = p[29].v;
  τ += 29;
  O;
}
static N(ο29) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο29;
  τ -= 29;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  p[28].v = ν[τ + 27].v;
  p[29].v = ν[τ + 28].v;
  O;
}

static N(unο30) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  ν[τ + 27].v = p[28].v;
  ν[τ + 28].v = p[29].v;
  ν[τ + 29].v = p[30].v;
  τ += 30;
  O;
}
static N(ο30) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο30;
  τ -= 30;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  p[28].v = ν[τ + 27].v;
  p[29].v = ν[τ + 28].v;
  p[30].v = ν[τ + 29].v;
  O;
}

static N(unο31) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  ν[τ + 27].v = p[28].v;
  ν[τ + 28].v = p[29].v;
  ν[τ + 29].v = p[30].v;
  ν[τ + 30].v = p[31].v;
  τ += 31;
  O;
}
static N(ο31) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unο31;
  τ -= 31;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  p[28].v = ν[τ + 27].v;
  p[29].v = ν[τ + 28].v;
  p[30].v = ν[τ + 29].v;
  p[31].v = ν[τ + 30].v;
  O;
}

n_t ο[32] = {
  ο0,
  ο1,
  ο2,
  ο3,
  ο4,
  ο5,
  ο6,
  ο7,
  ο8,
  ο9,
  ο10,
  ο11,
  ο12,
  ο13,
  ο14,
  ο15,
  ο16,
  ο17,
  ο18,
  ο19,
  ο20,
  ο21,
  ο22,
  ο23,
  ο24,
  ο25,
  ο26,
  ο27,
  ο28,
  ο29,
  ο30,
  ο31,
};
