#include "oant.h"
#include "oant_logn.h"
#define QPS 64
p_t qp[QPS][32];
W_t qw = 0, qr = 0;
static N(Ψ0) { qp[qr][0].c(T); }

static N(unroll1) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  τ += 1;
  O;
}
static N(Ψ1) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll1;
  τ -= 1;
  p[1].v = ν[τ + 0].v;
  O;
}

static N(unroll2) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  τ += 2;
  O;
}
static N(Ψ2) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll2;
  τ -= 2;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  O;
}

static N(unroll3) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  τ += 3;
  O;
}
static N(Ψ3) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll3;
  τ -= 3;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  O;
}

static N(unroll4) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  τ += 4;
  O;
}
static N(Ψ4) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll4;
  τ -= 4;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  O;
}

static N(unroll5) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  τ += 5;
  O;
}
static N(Ψ5) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll5;
  τ -= 5;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  O;
}

static N(unroll6) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  τ += 6;
  O;
}
static N(Ψ6) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll6;
  τ -= 6;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  O;
}

static N(unroll7) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  τ += 7;
  O;
}
static N(Ψ7) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll7;
  τ -= 7;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  O;
}

static N(unroll8) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  τ += 8;
  O;
}
static N(Ψ8) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll8;
  τ -= 8;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  O;
}

static N(unroll9) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  τ += 9;
  O;
}
static N(Ψ9) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll9;
  τ -= 9;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  O;
}

static N(unroll10) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  τ += 10;
  O;
}
static N(Ψ10) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll10;
  τ -= 10;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  O;
}

static N(unroll11) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  τ += 11;
  O;
}
static N(Ψ11) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll11;
  τ -= 11;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  O;
}

static N(unroll12) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  τ += 12;
  O;
}
static N(Ψ12) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll12;
  τ -= 12;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  O;
}

static N(unroll13) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  τ += 13;
  O;
}
static N(Ψ13) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll13;
  τ -= 13;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  O;
}

static N(unroll14) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  τ += 14;
  O;
}
static N(Ψ14) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll14;
  τ -= 14;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  O;
}

static N(unroll15) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  τ += 15;
  O;
}
static N(Ψ15) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll15;
  τ -= 15;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  O;
}

static N(unroll16) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  τ += 16;
  O;
}
static N(Ψ16) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll16;
  τ -= 16;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  O;
}

static N(unroll17) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  τ += 17;
  O;
}
static N(Ψ17) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll17;
  τ -= 17;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  O;
}

static N(unroll18) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  τ += 18;
  O;
}
static N(Ψ18) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll18;
  τ -= 18;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  O;
}

static N(unroll19) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  τ += 19;
  O;
}
static N(Ψ19) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll19;
  τ -= 19;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  O;
}

static N(unroll20) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  τ += 20;
  O;
}
static N(Ψ20) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll20;
  τ -= 20;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  O;
}

static N(unroll21) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  τ += 21;
  O;
}
static N(Ψ21) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll21;
  τ -= 21;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  O;
}

static N(unroll22) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  τ += 22;
  O;
}
static N(Ψ22) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll22;
  τ -= 22;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  O;
}

static N(unroll23) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  τ += 23;
  O;
}
static N(Ψ23) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll23;
  τ -= 23;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  O;
}

static N(unroll24) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  τ += 24;
  O;
}
static N(Ψ24) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll24;
  τ -= 24;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  O;
}

static N(unroll25) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  τ += 25;
  O;
}
static N(Ψ25) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll25;
  τ -= 25;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  O;
}

static N(unroll26) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  τ += 26;
  O;
}
static N(Ψ26) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll26;
  τ -= 26;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  O;
}

static N(unroll27) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  τ += 27;
  O;
}
static N(Ψ27) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll27;
  τ -= 27;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  O;
}

static N(unroll28) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  ν[τ + 27].v = p[28].v;
  τ += 28;
  O;
}
static N(Ψ28) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll28;
  τ -= 28;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  p[28].v = ν[τ + 27].v;
  O;
}

static N(unroll29) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  ν[τ + 27].v = p[28].v;
  ν[τ + 28].v = p[29].v;
  τ += 29;
  O;
}
static N(Ψ29) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll29;
  τ -= 29;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  p[28].v = ν[τ + 27].v;
  p[29].v = ν[τ + 28].v;
  O;
}

static N(unroll30) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  ν[τ + 27].v = p[28].v;
  ν[τ + 28].v = p[29].v;
  ν[τ + 29].v = p[30].v;
  τ += 30;
  O;
}
static N(Ψ30) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll30;
  τ -= 30;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  p[28].v = ν[τ + 27].v;
  p[29].v = ν[τ + 28].v;
  p[30].v = ν[τ + 29].v;
  O;
}

static N(unroll31) {
  p_t *p = qp[qr];
  qr = (qr + 1) % QPS;
  ν[τ + 0].v = p[1].v;
  ν[τ + 1].v = p[2].v;
  ν[τ + 2].v = p[3].v;
  ν[τ + 3].v = p[4].v;
  ν[τ + 4].v = p[5].v;
  ν[τ + 5].v = p[6].v;
  ν[τ + 6].v = p[7].v;
  ν[τ + 7].v = p[8].v;
  ν[τ + 8].v = p[9].v;
  ν[τ + 9].v = p[10].v;
  ν[τ + 10].v = p[11].v;
  ν[τ + 11].v = p[12].v;
  ν[τ + 12].v = p[13].v;
  ν[τ + 13].v = p[14].v;
  ν[τ + 14].v = p[15].v;
  ν[τ + 15].v = p[16].v;
  ν[τ + 16].v = p[17].v;
  ν[τ + 17].v = p[18].v;
  ν[τ + 18].v = p[19].v;
  ν[τ + 19].v = p[20].v;
  ν[τ + 20].v = p[21].v;
  ν[τ + 21].v = p[22].v;
  ν[τ + 22].v = p[23].v;
  ν[τ + 23].v = p[24].v;
  ν[τ + 24].v = p[25].v;
  ν[τ + 25].v = p[26].v;
  ν[τ + 26].v = p[27].v;
  ν[τ + 27].v = p[28].v;
  ν[τ + 28].v = p[29].v;
  ν[τ + 29].v = p[30].v;
  ν[τ + 30].v = p[31].v;
  τ += 31;
  O;
}
static N(Ψ31) {
  p_t *p = qp[qw];
  qw = (qw + 1) % QPS;
  p[0].v = unroll31;
  τ -= 31;
  p[1].v = ν[τ + 0].v;
  p[2].v = ν[τ + 1].v;
  p[3].v = ν[τ + 2].v;
  p[4].v = ν[τ + 3].v;
  p[5].v = ν[τ + 4].v;
  p[6].v = ν[τ + 5].v;
  p[7].v = ν[τ + 6].v;
  p[8].v = ν[τ + 7].v;
  p[9].v = ν[τ + 8].v;
  p[10].v = ν[τ + 9].v;
  p[11].v = ν[τ + 10].v;
  p[12].v = ν[τ + 11].v;
  p[13].v = ν[τ + 12].v;
  p[14].v = ν[τ + 13].v;
  p[15].v = ν[τ + 14].v;
  p[16].v = ν[τ + 15].v;
  p[17].v = ν[τ + 16].v;
  p[18].v = ν[τ + 17].v;
  p[19].v = ν[τ + 18].v;
  p[20].v = ν[τ + 19].v;
  p[21].v = ν[τ + 20].v;
  p[22].v = ν[τ + 21].v;
  p[23].v = ν[τ + 22].v;
  p[24].v = ν[τ + 23].v;
  p[25].v = ν[τ + 24].v;
  p[26].v = ν[τ + 25].v;
  p[27].v = ν[τ + 26].v;
  p[28].v = ν[τ + 27].v;
  p[29].v = ν[τ + 28].v;
  p[30].v = ν[τ + 29].v;
  p[31].v = ν[τ + 30].v;
  O;
}

n_t Ψ[32] = {
  Ψ0,
  Ψ1,
  Ψ2,
  Ψ3,
  Ψ4,
  Ψ5,
  Ψ6,
  Ψ7,
  Ψ8,
  Ψ9,
  Ψ10,
  Ψ11,
  Ψ12,
  Ψ13,
  Ψ14,
  Ψ15,
  Ψ16,
  Ψ17,
  Ψ18,
  Ψ19,
  Ψ20,
  Ψ21,
  Ψ22,
  Ψ23,
  Ψ24,
  Ψ25,
  Ψ26,
  Ψ27,
  Ψ28,
  Ψ29,
  Ψ30,
  Ψ31,
};
